test/data/out/cred-note-base.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sum="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroLR.xsd" xmlns:sum1="https://www2.agenciatributaria.gob.es/static_files/common/internet/dep/aplicaciones/es/aeat/tike/cont/ws/SuministroInformacion.xsd">
  <soapenv:Body>
    <sum:RegFactuSistemaFacturacion>
      <sum:Cabecera>
        <sum1:ObligadoEmision>
          <sum1:NombreRazon>Provide One S.L.</sum1:NombreRazon>
          <sum1:NIF>B98602642</sum1:NIF>
        </sum1:ObligadoEmision>
      </sum:Cabecera>
      <sum:RegistroFactura>
        <sum1:RegistroAnulacion>
          <IDVersion>1.0</IDVersion>
          <IDFactura>
            <sum1:IDEmisorFactura>B98602642</sum1:IDEmisorFactura>
            <sum1:NumSerieFactura>FR-012</sum1:NumSerieFactura>
            <sum1:FechaExpedicionFactura>01-02-2022</sum1:FechaExpedicionFactura>
          </IDFactura>
          <SinRegistroPrevio></SinRegistroPrevio>
          <GeneradoPor>E</GeneradoPor>
          <Generador>
            <sum1:NombreRazon>Provide One S.L.</sum1:NombreRazon>
            <sum1:NIF>B98602642</sum1:NIF>
          </Generador>
          <SistemaInformatico>
            <sum1:NombreRazon>Invopop S.L.</sum1:NombreRazon>
            <sum1:NIF>B85905495</sum1:NIF>
            <sum1:NombreSistemaInformatico>gobl.verifactu</sum1:NombreSistemaInformatico>
            <sum1:IdSistemaInformatico>A1</sum1:IdSistemaInformatico>
            <sum1:Version>1.0</sum1:Version>
            <sum1:NumeroInstalacion>00001</sum1:NumeroInstalacion>
            <sum1:TipoUsoPosibleSoloVerifactu>S</sum1:TipoUsoPosibleSoloVerifactu>
            <sum1:TipoUsoPosibleMultiOT>S</sum1:TipoUsoPosibleMultiOT>
            <sum1:IndicadorMultiplesOT>S</sum1:IndicadorMultiplesOT>
          </SistemaInformatico>
          <FechaHoraHusoGenRegistro>2024-11-21T18:26:22+01:00</FechaHoraHusoGenRegistro>
          <TipoHuella>01</TipoHuella>
          <Huella></Huella>
          <Signature></Signature>
        </sum1:RegistroAnulacion>
      </sum:RegistroFactura>
    </sum:RegFactuSistemaFacturacion>
  </soapenv:Body>
</soapenv:Envelope>
